<?php ## Перехоплення вихідного потоку скрипта

// Встановлюємо перехват у буфер 1
ob_start();

    // Наступний текст попадає у буфер 1
    echo "Цей текст належить буферу №1<br>\n";

    // Відкладаємо на деякий час буфер 1 та ативовуємо другий
    ob_start(); // буфер №2

        // Наступний текст попадає у буфер 2
        echo "Цей текст належить буферу №2<br>\n";

        // Отримуємо текст у другому буфері
        $second = ob_get_contents();

    // Відключаємо (без виводу у браузер) буфер 2 та активовуємо перший
    ob_end_clean();

    // Потрапить знову у буфер №1
    echo "Другий текст теж належить буферу №1<br>\n";

    // Отримуємо текст з першого буфера
    $first = ob_get_contents();

// Остання буферізація - вимикаємо
ob_end_clean();

// Обробляємо буфери для більш красивого виводу
$first = preg_replace('#^#m', '&nbsp;&nbsp;', trim($first));
$second = preg_replace('#^#m', '&nbsp;&nbsp;', trim($second));

// Роздруковуємо значення буферів, які ми зберегли у масиві
echo "<i>Вміст першого буферу:</i><br>$first";
echo "<i>Вміст другого буферу:</i><br>$second";
