<?php ## Створення малюнка "на льоту". З посилання http://button.php?Hello, World!

// Отримуємо рядок, який був переданий у параметрах
$string = $_SERVER['QUERY_STRING'] ?? 'Hello, World!';

// Завантажуємо малюнок фону з диску
$im = imagecreatefromgif('button.gif');

// Створюємо у палітрі новий колір - чорний
$color = imagecolorallocate($im, 255, 255, 255);

// Обчислюємо розмір тексту, який буде виведений
$px = (imagesx($im)-6.5*strlen($string))/2;

// Виводимо рядок поверх того що було у завантаженому малюнку
imagestring($im, 3, $px, 1, $string, $color);

// Повідомляємо про те, що далі йде малюнок PNG
header("Content-type: image/png");

// Тепер - саме головне: відправляємо дані малюнку у стандартний вихідний поток, тобто у браузер
imagepng($im);

// Наприкінці звільняємо пам'ять, яку займає малюнок
imagedestroy($im);