<?php ## "Емуляція" браузера

// З'єднуємося з Web-сервером localhost. Зверніть увагу, що префікс http:// - не використовується
// Інформація про протокол і так знаходиться у номері порта (80).
$fp = fsockopen('localhost', 80);

// Надсилаємо запит головній сторінці серверу.
// Кінець рядку у вигляді \r\n відповідає стандарту протоколу HTTP.
fputs($fp, "GET / HTTP/1.1\r\n");

// Відсилаємо обов'язковий для HTTP 1.1 заголовок Host.
fputs($fp, "Host: localhost\r\n");

// Відключаємо режим Keep-alive, що змушує сервер ВІДРАЗУ закрити з'єднання після посилки відповіді,
// а не очикувати наступного запиту.
// Якщо спробувати прибрати цей рядок - робота скрипту сильно cповільнеться
fputs($fo, "Connection: close\r\n");

// Кінець заголовків
fputs($fp, "\r\n");

// Тепер зчитуємо по одному рядку та виводимо відповідь
echo '<pre>';
while (!feof($fp)) {
    echo htmlspecialchars(fgets($fp, 1000));
}
echo '</pre>';

// Від'єднуємося від серверу
fclose($fp);