<?php ##Користувацьке сортування по ключам
//Записуємо у $files зміст поточного каталогу
//масив з ключами - іменами файлів та значеннями - їх розмір
$d = opendir('.');
while (false !== ($e = readdir($d))) {
    if (is_dir($e)) {
        $files[$e] = 0;
    } else {
        $files[$e] = filesize($e);
    }
}
//Сортуємо його та друкуємо
uksort($files, function($f1, $f2)
{
    //Ця функція повинна порівнювати значення f1 та f2 (імена файлів чи каталогів)
    //та повертати:
    //-1, якщо $f1 < $f2,
    // 0, якщо $f1 == $f2,
    // 1, якщо $f1 > $f2.
    //Під < та > розуміється слідування цих імен у списку що виводиться
    //Каталог завжди передую файлу
    if (is_dir($f1) && !is_dir($f2)) {
        return -1;
    }
    if (!is_dir($f1) && is_dir($f2)) {
        return 1;
    }
    //Інакше порівнюємо лекикографічно
    return $f1 <=> $f2;
});
echo '<pre>';
print_r($files);
echo '</pre>';