<?php ##Виведення дерева каталогів файлової системи
//Функція виводить імена усіх підкаталогів у поточному каталозі
//виконуючи рекурсивний обхід. Параметр $level завдає поточну
//глибину рекурсії
function printTree($level = 1)
{
    //Відкриваємо каталог та виходимо у разі помилки
    $d = @opendir('.');
    if (!$d) {
        return;
    }
    while (($e = readdir($d)) !== false) {
        //ігноруємо елементи . та ..
        if ($e == '.' || $e == '..') {
            continue;
        }
        //нам потрібні лише підкаталоги
        if (!@is_dir($e)) {
            continue;
        }
        //друкуємо пробіли щоб змістити вивід
        for ($i = 0; $i <= $level; ++$i) {
            echo ' ';
        }
        //виводимо поточний елемент
        echo $e.'<br>';
        //входимо у поточний каталог та друкуємо його
        if (!chdir($e)) {
            continue;
        }
        printTree($level + 1);
        //повертаємося назад
        chdir('..');
        //відправляємо дані у браузер, щоб запобігти видимості зависання
        //для великих роздруківок
        flush();
    }
    closedir($d);
}
//Виводимо решту тексту фіксованим шрифтом
echo '<pre>';
echo '<br>';
//входимо у кореневий каталог та друкуємо його
chdir($_SERVER['DOCUMENT_ROOT']);
printTree();
echo '</pre>';